Reports/СверкаДекларацийПрибыльНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаДекларацийПрибыльНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоляРасшифровки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СверкаДекларацийПрибыльНДС/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыПриСоздании(); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(Отчет.Данные) Тогда
		СформироватьОтчет();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда) 

	СформироватьОтчет();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовШапки

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("НачалоПериода",    НачалоГода(Отчет.НачалоПериода));
	ПараметрыВыбора.Вставить("КонецПериода",     КонецГода(Отчет.КонецПериода));
	ПараметрыВыбора.Вставить("Кратность",        ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	ПараметрыВыбора.Вставить("МинимальныйПериод", '20230101');
	
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаКварталНарастающимИтогом",
		ПараметрыВыбора,ЭтаФорма,,,,Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект));
		
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)

	СтандартнаяОбработка = Ложь;
	ПоляРасшифровки = РасшифроватьЯчейку(Расшифровка, ДанныеРасшифровки);	
	Если ПоляРасшифровки = Неопределено Тогда 
		Возврат;	
	КонецЕсли;  
	
	ПараметрыФормы = ПараметрыРасчета();
	ПараметрыФормы.КонецПериода = КварталКонец(ПараметрыФормы.КонецПериода, ПоляРасшифровки["Квартал"]);	
    ПараметрыФормы.Вставить("ПоляРасшифровки", ПоляРасшифровки);
	КлючФормы = СтрШаблон("%1_%2_%3", ЭтотОбъект.УникальныйИдентификатор, ПоляРасшифровки["Номер"], ПоляРасшифровки["Квартал"]);		
	ОткрытьФорму("Отчет.СверкаДекларацийПрибыльНДС.Форма.Расшифровка",
		ПараметрыФормы,	ЭтаФорма, КлючФормы,,,,РежимОткрытияОкнаФормы.Независимый); 
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция РасшифроватьЯчейку(Идентификатор, АдресРасшифровки)
	
	ЭлементыРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровки).Элементы;
  	ПоляРасшифровки = Отчеты.СверкаДекларацийПрибыльНДС.ПоляРасшифровкиСКД(ЭлементыРасшифровки[Идентификатор]);
	Если Не ЗначениеЗаполнено(ПоляРасшифровки.Получить("Показатель")) ИЛИ 
		Не ЗначениеЗаполнено(ПоляРасшифровки.Получить("Квартал")) Тогда
		Возврат Неопределено;
	КонецЕсли;                    
		
	ИмеетРасшифровку = Отчеты.СверкаДекларацийПрибыльНДС.ИмеетРасшифровку(ПоляРасшифровки["Номер"]);
	Если Не ИмеетРасшифровку Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	Возврат ПоляРасшифровки;
	
КонецФункции 

&НаСервереБезКонтекста
Функция КварталКонец(Период, Квартал)

	Период = НачалоГода(Период);
	Возврат КонецКвартала(ДобавитьМесяц(Период, (Квартал - 1) * 3));  

КонецФункции

&НаКлиенте
Процедура ВыборПериодаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Отчет.НачалоПериода = Результат.НачалоПериода;
	Отчет.КонецПериода = КонецДня(Результат.КонецПериода);  
	
	Период = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
			Отчет.НачалоПериода, Отчет.КонецПериода, Истина);
		
КонецПроцедуры

&НаКлиенте
Функция ПараметрыРасчета()

	ПараметрыРасчета = Новый Структура("Организация, НачалоПериода, КонецПериода");	
	ЗаполнитьЗначенияСвойств(ПараметрыРасчета, ЭтотОбъект.Отчет);
	Возврат ПараметрыРасчета;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыПриСоздании()  
	
	ЗаполнитьЗначенияСвойств(Отчет, БухгалтерскиеОтчеты.БазовыеРеквизитыЗначенияПоУмолчанию()); 
	ЗаполнитьЗначенияСвойств(Отчет, Параметры); 
	Отчет.НачалоПериода = НачалоКвартала(Отчет.НачалоПериода);	
	Отчет.КонецПериода = КонецКвартала(Отчет.КонецПериода);	
	
	Период = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		Отчет.НачалоПериода, Отчет.КонецПериода, Истина);
	
КонецПроцедуры      


#Область ФормированиеОтчета

&НаКлиенте
Процедура СформироватьОтчет()
	
	Задание = НачатьФормированиеОтчета();
	ОжидатьФормированиеОтчета(Задание);
	
КонецПроцедуры

&НаСервере
Функция НачатьФормированиеОтчета()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ПараметрыКомпоновки = ОтчетОбъект.ПараметрыКомпоновки();
		
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = БухгалтерскиеОтчетыКлиентСервер.ПолучитьНаименованиеЗаданияВыполненияОтчета(ЭтотОбъект);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыЗадания, "Отчеты.СверкаДекларацийПрибыльНДС.СформироватьОтчет", ПараметрыКомпоновки);
	
КонецФункции 
	
&НаКлиенте
Процедура ОжидатьФормированиеОтчета(Задание)
	
	Если Задание.Статус = "Выполняется" Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
		
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ФормированиеОтчетаЗавершение", ЭтотОбъект);
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеОтчетаЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатВыполнения.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	ЗавершитьФормированиеОтчета(РезультатВыполнения);
			
КонецПроцедуры  

&НаСервере
Процедура ЗавершитьФормированиеОтчета(РезультатВыполнения)
	
	Если Не РезультатВыполнения.Статус = "Выполнено" Тогда
		Возврат;	
	КонецЕсли;
	
	Отчет.Данные = Неопределено;
	РезультатФормирования = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
	Результат = РезультатФормирования.Результат;
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(РезультатФормирования.ДанныеРасшифровки, УникальныйИдентификатор); 
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		
КонецПроцедуры

#КонецОбласти


#КонецОбласти
